In [43]:
import pandas as pd 
import numpy as np

In [44]:
file="./purchase_data.csv"

In [45]:
df=pd.read_csv(file)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [46]:
#find total count of players 

len(pd.unique(df["SN"]))

576

In [47]:
pd.DataFrame ({
    "Total Players": [576] 
})

   Total Players
0            576

In [48]:
#number of unique items 

len(pd.unique(df["Item Name"]))

179

In [49]:
#average purchase price
df.loc[:,"Price"].mean()

3.050987179487176

In [50]:
#total number of purchases 

len(df["Price"])

780

In [51]:
#sum of total revenue 

sum(df["Price"])

2379.7699999999973

In [52]:
pd.DataFrame({
    "Number of Unique Items" :[179], "Average Purchase Price" : [3.05], "Total Number of Purchases" :[780], "Total Revenue":[2379.78]
})

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.05,780,2379.78

In [53]:
#% and count of male players 

len(df["Gender"])
m_df=df[df['Gender']=='Male']
m_df.count()

Purchase ID    652
SN             652
Age            652
Gender         652
Item ID        652
Item Name      652
Price          652
dtype: int64

In [54]:
f_df=df[df["Gender"]=="Female"]
f_df.count()

Purchase ID    113
SN             113
Age            113
Gender         113
Item ID        113
Item Name      113
Price          113
dtype: int64

In [55]:
other_df=df[df["Gender"]=="Other / Non-Disclosed"]
other_df.count()

Purchase ID    15
SN             15
Age            15
Gender         15
Item ID        15
Item Name      15
Price          15
dtype: int64

In [56]:
percentage_m_df =len(m_df) / len(df["Gender"]) *100
print(percentage_m_df)

83.58974358974359

In [57]:
percentage_f_df=len(f_df) / len(df["Gender"]) *100
print(percentage_f_df)

14.487179487179489

In [58]:
percentage_other_df= len(other_df) / len(df["Gender"]) *100
print(percentage_other_df)

1.9230769230769231

In [79]:
pd.DataFrame({
    "Percentage and Count of Male Players":["83%",652], "Percentage and Count of Female Players":["14%",113], "Percentage and Count of Other / Non-Disclosed" : ["1.92%", 15]
})

,Percentage and Count of Male Players,Percentage and Count of Female Players,Percentage and Count of Other / Non-Disclosed
0,83%,14%,1.92%
1,652,113,15

In [60]:
#purchase count for male #average purchase price for each gender 

df.groupby('Gender').agg({
    "Price": ["count","sum","mean"],
    "SN":"nunique"
              })

                      Price                         SN
                      count      sum      mean nunique
Gender
Female                  113   361.94  3.203009      81
Male                    652  1967.64  3.017853     484
Other / Non-Disclosed    15    50.19  3.346000      11

In [74]:
#The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.)
#Purchase Count

bins = [0,10,15,20,25,30,35,40,41]
age_ranges = ["<10", "10-14","15-19", "20-24", "25-29", "30-34", "35-39", ">=40"]

In [80]:
pd.cut(df['Age'], bins, labels=age_ranges)

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
5      20-24
6      35-39
7      15-19
8      20-24
9      30-34
10     20-24
11     20-24
12     20-24
13     20-24
14     30-34
15     20-24
16     15-19
17     20-24
18     20-24
19     25-29
20     15-19
21     15-19
22     35-39
23     35-39
24     25-29
25     25-29
26     10-14
27       <10
28     20-24
29     20-24
       ...
750    20-24
751    10-14
752    15-19
753    35-39
754    20-24
755    10-14
756    15-19
757    15-19
758    20-24
759    20-24
760    20-24
761      NaN
762    25-29
763    20-24
764    15-19
765    15-19
766    20-24
767      <10
768    35-39
769    10-14
770    30-34
771    15-19
772    25-29
773    20-24
774    10-14
775    20-24
776    20-24
777    15-19
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < >=40]

In [84]:
df['Age Range']=pd.cut(df['Age'], bins, labels=age_ranges)
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [96]:
df.groupby('Age Range').agg({
    "Item ID":['count'],
    "Price":['sum','mean']
    
})

          Item ID   Price
            count     sum      mean
Age Range
<10            32  108.96  3.405000
10-14          54  156.60  2.900000
15-19         200  621.56  3.107800
20-24         325  981.64  3.020431
25-29          77  221.42  2.875584
30-34          52  155.71  2.994423
35-39          33  112.35  3.404545
>=40            2    6.54  3.270000

In [135]:
players_purchase_count_df = df.groupby("SN").count()["Price"].rename("Purchase Count")
players_average_price_df = df.groupby("SN").mean()["Price"].rename("Average Purchase Price")
players_total_df = df.groupby("SN").sum()["Price"].rename("Total Purchase Value")

total_user_data_df = pd.DataFrame({"Purchase Count":players_purchase_count_df,
                                   "Average Purchase Price": players_average_price_df,
                                   "Total Purchase Value": players_total_df})
total_user_data_df.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [140]:
top_five_spenders = total_user_data_df.sort_values("Total Purchase Value", ascending=False)
top_five_spenders.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [138]:
item_purchase_count_df = df.groupby("Item Name").count()["Item ID"].rename("Item Count")
item_average_price_df = df.groupby("Item Name").mean()["Item ID"].rename("Item Purchase Price")
item_total_df = df.groupby("Item Name").sum()["Item ID"].rename("Total Purchase Value")

total_item_data_df = pd.DataFrame({"Item Count":item_purchase_count_df,
                                   "Average Item Price": item_average_price_df,
                                   "Total Purchase Value": item_total_df})
total_item_data_df.head()

,Item Count,Average Item Price,Total Purchase Value
Item Name,,,
Abyssal Shard,5,2.67,13.35
"Aetherius, Boon of the Blessed",5,3.39,16.95
Agatha,6,3.08,18.48
Alpha,3,2.07,6.21
"Alpha, Oath of Zeal",3,4.05,12.15

In [144]:
top_five_popular_items=total_item_data_df.sort_values("Item Count", ascending=False)
top_five_popular_items.head()

,Item Count,Average Item Price,Total Purchase Value
Item Name,,,
Final Critic,13,4.614615,59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
Persuasion,9,3.221111,28.99
Nirvana,9,4.900000,44.10
"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [145]:
top_five_profit_items=total_item_data_df.sort_values("Total Purchase Value", ascending=False)
top_five_profit_items.head()

,Item Count,Average Item Price,Total Purchase Value
Item Name,,,
Final Critic,13,4.614615,59.99
"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
Nirvana,9,4.900000,44.10
Fiery Glass Crusader,9,4.580000,41.22
Singed Scalpel,8,4.350000,34.80